## Plan Result (sbox-dcd_cftapps_sbox-acme)




<pre><code>Plan: 6 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.acme.azuread_group_member.dnszonecontributor
  * module.acme.azurerm_role_assignment.Reader
  * module.acme.azurerm_role_assignment.kvaccess
  * module.acme.azurerm_role_assignment.kvgroupaccess
  * module.acme.azurerm_service_plan.asp
  * module.acme.azurerm_windows_function_app.funcapp
* Update
  * module.acme.azurerm_application_insights.appinsight
  * module.acme.azurerm_key_vault.kv
  * module.acme.azurerm_resource_group.rg
  * module.acme.azurerm_storage_account.stg




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acme.azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = "6c2d130e-ba66-408a-bdf9-f426a9730923"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.acme.azurerm_application_insights.appinsight will be updated in-place
  ~ resource "azurerm_application_insights" "appinsight" {
        id                                    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/microsoft.insights/components/cft-platform-sbox"
        name                                  = "cft-platform-sbox"
      ~ tags                                  = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
      ~ enabled_for_deployment          = false -> true
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
        name                            = "acmedcdcftappssbox"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acme.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg"
        name     = "cft-platform-sbox-rg"
      ~ tags     = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme.azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme.azurerm_role_assignment.kvgroupaccess will be created
  + resource "azurerm_role_assignment" "kvgroupaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme.azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "cft-platform-sbox-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "cft-platform-sbox-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + worker_count                 = (known after apply)
    }

  # module.acme.azurerm_storage_account.stg will be updated in-place
  ~ resource "azurerm_storage_account" "stg" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Storage/storageAccounts/acmedcdcftappssbox"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "acmedcdcftappssbox"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (4 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.acme.azurerm_windows_function_app.funcapp will be created
  + resource "azurerm_windows_function_app" "funcapp" {
      + app_settings                      = {
          + "Acmebot:AzureDns:SubscriptionId"            = "b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
          + "Acmebot:Contacts"                           = "cnp-acme-owner@hmcts.net"
          + "Acmebot:Endpoint"                           = "https://acme-v02.api.letsencrypt.org/"
          + "Acmebot:Environment"                        = "AzureCloud"
          + "Acmebot:VaultBaseUrl"                       = "https://acmedcdcftappssbox.vault.azure.net/"
          + "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          + "FUNCTIONS_WORKER_RUNTIME"                   = "dotnet"
          + "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"   = (sensitive)
          + "WEBSITE_CONTENTSHARE"                       = "cft-platform-sbox"
          + "WEBSITE_RUN_FROM_PACKAGE"                   = "https://stacmebotprod.blob.core.windows.net/keyvault-acmebot/v4/latest.zip"
        }
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "acmedcdcftappssbox"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "cft-platform-sbox-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "acmedcdcftappssbox"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + auth_settings {
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = "AzureActiveDirectory"
          + enabled                        = true
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = 72
          + token_store_enabled            = false
          + unauthenticated_client_action  = "RedirectToLoginPage"

          + active_directory {
              + client_id = "66a54942-60fc-40e0-9810-4f99c13a157e"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + ip_restriction                         = (known after apply)
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_ip_restriction                     = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)
        }
    }

Plan: 6 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"sbox-dcd_cftapps_sbox-acme","Vars":{}} -->